In [1]:
import pandas as pd
from config import db_password
from pathlib import Path
from sqlalchemy import create_engine, inspect
import matplotlib.pyplot as plt
import numpy as np
from sklearn.linear_model import LinearRegression
from sklearn.ensemble import RandomForestClassifier
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split
from sklearn.metrics import confusion_matrix, accuracy_score, classification_report

In [2]:
# create enginge instance to connect to postgresDB to retrieve data
db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/NYC_Vehicle_Collision_Prediction"
engine = create_engine(db_string)
connection = engine.connect()

In [3]:
# retrieve tables from postgres connection
inspector = inspect(engine)
inspector.get_table_names()

# Query ALL Records in the the Database
collision_df = pd.read_sql("SELECT * from collisions", connection)
collision_df.drop(columns=["index"])

         NUMBER OF PERSONS INJURED  NUMBER OF PERSONS KILLED  COLLISION_ID
0                              2.0                       0.0       4455765
1                              1.0                       0.0       4513547
2                              0.0                       0.0       4541903
3                              0.0                       0.0       4456314
4                              0.0                       0.0       4486609
...                            ...                       ...           ...
1936663                        1.0                       0.0       4572947
1936664                        0.0                       0.0       4572848
1936665                        2.0                       0.0       4573314
1936666                        2.0                       0.0       4572706
1936667                        0.0                       0.0       4572443

[1936668 rows x 3 columns]

In [4]:
# retrieve tables from postgres connection
inspector = inspect(engine)
inspector.get_table_names()

# Query ALL Records in the the Database
datetime_df = pd.read_sql("SELECT * from date_time", connection)
datetime_df.drop(columns=["index"])

         CRASH DATE CRASH TIME  COLLISION_ID
0        2021-09-11       2:39       4455765
1        2022-03-26      11:45       4513547
2        2022-06-29       6:55       4541903
3        2021-09-11       9:35       4456314
4        2021-12-14       8:13       4486609
...             ...        ...           ...
1936700  2022-10-14      20:22       4572947
1936701  2022-10-12      16:30       4572848
1936702  2022-10-14      22:00       4573314
1936703  2022-10-14       1:00       4572706
1936704  2022-10-12      18:00       4572443

[1936705 rows x 3 columns]

In [5]:
# retrieve tables from postgres connection
inspector = inspect(engine)
inspector.get_table_names()

# Query ALL Records in the the Database
locations_df = pd.read_sql("SELECT * from locations", connection)
locations_df.drop(columns=["index"])

           BOROUGH  ZIP CODE  COLLISION_ID
0         BROOKLYN   11208.0       4456314
1         BROOKLYN   11233.0       4486609
2            BRONX   10475.0       4486660
3         BROOKLYN   11207.0       4487074
4        MANHATTAN   10017.0       4486519
...            ...       ...           ...
1335440     QUEENS   11385.0       4573422
1335441     QUEENS   11362.0       4572694
1335442   BROOKLYN   11234.0       4573135
1335443     QUEENS   11366.0       4573314
1335444  MANHATTAN   10013.0       4572443

[1335445 rows x 3 columns]

In [11]:
# Merging Collision and Datetime dataframes
merge_df = pd.merge(collision_df, datetime_df, how="left", on=["COLLISION_ID", "COLLISION_ID"])
merge_df

,index_x,NUMBER OF PERSONS INJURED,NUMBER OF PERSONS KILLED,COLLISION_ID,index_y,CRASH DATE,CRASH TIME
0,0,2.0,0.0,4455765,0,2021-09-11,2:39
1,1,1.0,0.0,4513547,1,2022-03-26,11:45
2,2,0.0,0.0,4541903,2,2022-06-29,6:55
3,3,0.0,0.0,4456314,3,2021-09-11,9:35
4,4,0.0,0.0,4486609,4,2021-12-14,8:13
...,...,...,...,...,...,...,...
1936663,1936663,1.0,0.0,4572947,1936700,2022-10-14,20:22
1936664,1936664,0.0,0.0,4572848,1936701,2022-10-12,16:30
1936665,1936665,2.0,0.0,4573314,1936702,2022-10-14,22:00
1936666,1936666,2.0,0.0,4572706,1936703,2022-10-14,1:00
1936667,1936667,0.0,0.0,4572443,1936704,2022-10-12,18:00

In [12]:
# Dropping index_X, index_Y
merge_df.drop(columns=["index_x","index_y"])

,NUMBER OF PERSONS INJURED,NUMBER OF PERSONS KILLED,COLLISION_ID,CRASH DATE,CRASH TIME
0,2.0,0.0,4455765,2021-09-11,2:39
1,1.0,0.0,4513547,2022-03-26,11:45
2,0.0,0.0,4541903,2022-06-29,6:55
3,0.0,0.0,4456314,2021-09-11,9:35
4,0.0,0.0,4486609,2021-12-14,8:13
...,...,...,...,...,...
1936663,1.0,0.0,4572947,2022-10-14,20:22
1936664,0.0,0.0,4572848,2022-10-12,16:30
1936665,2.0,0.0,4573314,2022-10-14,22:00
1936666,2.0,0.0,4572706,2022-10-14,1:00
1936667,0.0,0.0,4572443,2022-10-12,18:00

In [14]:
# Merging locations_df to merge_df
secondmerge_df = pd.merge(merge_df, locations_df, how="left", on=["COLLISION_ID", "COLLISION_ID"])
secondmerge_df

,index_x,NUMBER OF PERSONS INJURED,NUMBER OF PERSONS KILLED,COLLISION_ID,index_y,CRASH DATE,CRASH TIME,index,BOROUGH,ZIP CODE
0,0,2.0,0.0,4455765,0,2021-09-11,2:39,NaN,NaN,NaN
1,1,1.0,0.0,4513547,1,2022-03-26,11:45,NaN,NaN,NaN
2,2,0.0,0.0,4541903,2,2022-06-29,6:55,NaN,NaN,NaN
3,3,0.0,0.0,4456314,3,2021-09-11,9:35,0.0,BROOKLYN,11208.0
4,4,0.0,0.0,4486609,4,2021-12-14,8:13,1.0,BROOKLYN,11233.0
...,...,...,...,...,...,...,...,...,...,...
1936663,1936663,1.0,0.0,4572947,1936700,2022-10-14,20:22,NaN,NaN,NaN
1936664,1936664,0.0,0.0,4572848,1936701,2022-10-12,16:30,NaN,NaN,NaN
1936665,1936665,2.0,0.0,4573314,1936702,2022-10-14,22:00,1335443.0,QUEENS,11366.0
1936666,1936666,2.0,0.0,4572706,1936703,2022-10-14,1:00,NaN,NaN,NaN
1936667,1936667,0.0,0.0,4572443,1936704,2022-10-12,18:00,1335444.0,MANHATTAN,10013.0

In [19]:
# Dropping unnecesary columns
injured_df=secondmerge_df.drop(columns=["index_x","index_y", "index", "COLLISION_ID", "NUMBER OF PERSONS INJURED"])
injured_df.dropna(axis=0,how='any',inplace=True)

In [20]:
# Renaming CRASH TIME to CRASHTIME
injured_df.rename(columns={'CRASH TIME': 'CRASHTIME'})

         NUMBER OF PERSONS KILLED  CRASH DATE CRASHTIME    BOROUGH  ZIP CODE
3                             0.0  2021-09-11      9:35   BROOKLYN   11208.0
4                             0.0  2021-12-14      8:13   BROOKLYN   11233.0
7                             0.0  2021-12-14      8:17      BRONX   10475.0
8                             0.0  2021-12-14     21:10   BROOKLYN   11207.0
9                             0.0  2021-12-14     14:58  MANHATTAN   10017.0
...                           ...         ...       ...        ...       ...
1936657                       0.0  2022-10-14     14:55     QUEENS   11385.0
1936660                       0.0  2022-10-13     16:07     QUEENS   11362.0
1936661                       0.0  2022-10-14      8:00   BROOKLYN   11234.0
1936665                       0.0  2022-10-14     22:00     QUEENS   11366.0
1936667                       0.0  2022-10-12     18:00  MANHATTAN   10013.0

[1335419 rows x 5 columns]

In [21]:
injured_df.dtypes

NUMBER OF PERSONS KILLED    float64
CRASH DATE                   object
CRASH TIME                   object
BOROUGH                      object
ZIP CODE                    float64
dtype: object

In [22]:
# Converting Crash Date
injured_df['CRASH DATE']= pd.to_datetime(injured_df['CRASH DATE'])

In [25]:
# Filter data for years 2016 and 2017
year2016_2017_df = injured_df.loc[(injured_df['CRASH DATE'].dt.year == 2016) | (injured_df['CRASH DATE'].dt.year == 2017)]
year2016_2017_df

         NUMBER OF PERSONS KILLED CRASH DATE CRASH TIME    BOROUGH  ZIP CODE
844                           0.0 2016-04-16      14:20   BROOKLYN   11214.0
42999                         0.0 2016-06-02       7:28   BROOKLYN   11210.0
45817                         0.0 2016-06-06      14:56   BROOKLYN   11212.0
45818                         0.0 2016-09-26      16:58   BROOKLYN   11203.0
64161                         0.0 2017-02-19      16:10   BROOKLYN   11203.0
...                           ...        ...        ...        ...       ...
1200671                       0.0 2016-01-07      16:45     QUEENS   11373.0
1200672                       0.0 2016-01-19      12:00   BROOKLYN   11214.0
1200673                       0.0 2016-01-08      15:05  MANHATTAN   10017.0
1200674                       0.0 2016-01-08      13:34      BRONX   10473.0
1200675                       0.0 2016-01-16      18:45     QUEENS   11432.0

[296150 rows x 5 columns]

In [26]:
# Renaming columns
df = year2016_2017_df.rename(columns={'NUMBER OF PERSONS KILLED': 'KILLED', 'CRASH DATE': 'DATE', 'CRASH TIME':'TIME'})

In [27]:
df.dtypes

KILLED             float64
DATE        datetime64[ns]
TIME                object
BOROUGH             object
ZIP CODE           float64
dtype: object

In [28]:
# Converting date and time columns to unique float values in order for model to read
df['DATE']= pd.to_datetime(df['DATE'])
df['DATE'] = (df['DATE'] - df['DATE'].min())  / np.timedelta64(1,'D')
df['TIME']= pd.to_datetime(df['TIME'])
df['TIME'] = (df['TIME'] - df['TIME'].min())  / np.timedelta64(1,'D')
df.dtypes

KILLED      float64
DATE        float64
TIME        float64
BOROUGH      object
ZIP CODE    float64
dtype: object

In [29]:
# Creating Borough Mapping for machine learning model
borough_mapping = {
    "BROOKLYN": 0,
    "BRONX": 1,
    "QUEENS": 2,
    "MANHATTAN": 3,
    "STATEN ISLAND": 4
}

df["BOROUGH"] = df["BOROUGH"].apply(lambda x: borough_mapping[x])
df

         KILLED   DATE      TIME  BOROUGH  ZIP CODE
844         0.0  106.0  0.597222        0   11214.0
42999       0.0  153.0  0.311111        0   11210.0
45817       0.0  157.0  0.622222        0   11212.0
45818       0.0  269.0  0.706944        0   11203.0
64161       0.0  415.0  0.673611        0   11203.0
...         ...    ...       ...      ...       ...
1200671     0.0    6.0  0.697917        2   11373.0
1200672     0.0   18.0  0.500000        0   11214.0
1200673     0.0    7.0  0.628472        3   10017.0
1200674     0.0    7.0  0.565278        1   10473.0
1200675     0.0   15.0  0.781250        2   11432.0

[296150 rows x 5 columns]

In [31]:
# Define the features set.
X = df.copy()
X = X.drop("KILLED", axis=1)
X.head()

        DATE      TIME  BOROUGH  ZIP CODE
844    106.0  0.597222        0   11214.0
42999  153.0  0.311111        0   11210.0
45817  157.0  0.622222        0   11212.0
45818  269.0  0.706944        0   11203.0
64161  415.0  0.673611        0   11203.0

In [32]:
# Define the target set.
y = df["KILLED"].ravel()
y[:5]

array([0., 0., 0., 0., 0.])

In [33]:
# Splitting into Train and Test sets.
X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=78)

In [34]:
# Creating a StandardScaler instance.
scaler = StandardScaler()
# Fitting the Standard Scaler with the training data.
X_scaler = scaler.fit(X_train)

# Scaling the data.
X_train_scaled = X_scaler.transform(X_train)
X_test_scaled = X_scaler.transform(X_test)

In [35]:
# Create a random forest classifier.
rf_model = RandomForestClassifier(n_estimators=128, random_state=78)

In [36]:
# Fitting the model
rf_model = rf_model.fit(X_train_scaled, y_train)

In [37]:
# Making predictions using the testing data.
predictions = rf_model.predict(X_test_scaled)

In [38]:
# Calculating the accuracy score.
acc_score = accuracy_score(y_test, predictions)

In [39]:
# Displaying results
print("Confusion Matrix")
display(df)
print(f"Accuracy Score : {acc_score}")
print("Classification Report")
print(classification_report(y_test, predictions))

Confusion Matrix

         KILLED   DATE      TIME  BOROUGH  ZIP CODE
844         0.0  106.0  0.597222        0   11214.0
42999       0.0  153.0  0.311111        0   11210.0
45817       0.0  157.0  0.622222        0   11212.0
45818       0.0  269.0  0.706944        0   11203.0
64161       0.0  415.0  0.673611        0   11203.0
...         ...    ...       ...      ...       ...
1200671     0.0    6.0  0.697917        2   11373.0
1200672     0.0   18.0  0.500000        0   11214.0
1200673     0.0    7.0  0.628472        3   10017.0
1200674     0.0    7.0  0.565278        1   10473.0
1200675     0.0   15.0  0.781250        2   11432.0

[296150 rows x 5 columns]

Accuracy Score : 0.9991625921823928
Classification Report
              precision    recall  f1-score   support

         0.0       1.00      1.00      1.00     73976
         1.0       0.50      0.02      0.03        62

    accuracy                           1.00     74038
   macro avg       0.75      0.51      0.52     74038
weighted avg       1.00      1.00      1.00     74038

In [40]:
# Calculate feature importance in the Random Forest model.
importances = rf_model.feature_importances_
importances

array([0.35820006, 0.41644681, 0.0275193 , 0.19783382])

In [41]:
# We can sort the features by their importance.
sorted(zip(rf_model.feature_importances_, X.columns), reverse=True)

[(0.416446811078867, 'TIME'),
 (0.3582000643053924, 'DATE'),
 (0.19783381962287613, 'ZIP CODE'),
 (0.027519304992864386, 'BOROUGH')]